Дипломная/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбонентскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Дипломная/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбоненскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

Дипломная/src/Catalogs/ДоговорыКонтрагентов/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьВидимостьРеквизитов();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	
	ОбновитьВидимостьРеквизитов();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимостьРеквизитов()
	
    Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание") Тогда
		
		Элементы.ВКМ_ДатаНачала.Видимость = Истина;
        Элементы.ВКМ_ДатаОкончания.Видимость = Истина;
        Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = Истина;
        Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = Истина;
		
    Иначе
		
		Элементы.ВКМ_ДатаНачала.Видимость = Ложь;
        Элементы.ВКМ_ДатаОкончания.Видимость = Ложь;
        Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = Ложь;
        Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = Ложь;

	КонецЕсли;
	
КонецПроцедуры
